In [18]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\dell\python3anacondajupyternotebook\lib\site-packages (1.4.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\python3anacondajupyternotebook\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in c:\users\dell\python3anacondajupyternotebook\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\dell\python3anacondajupyternotebook\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\dell\python3anacondajupyternotebook\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [19]:
import pandas as pd

In [20]:
## pass dict data to pd dataframe
data ={'Sqft':[500,750,300,450],'Price':[25000,37500,15000,22500]}
housing=pd.DataFrame(data)
housing

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000
3   450  22500

In [21]:
## set the index 
housing=pd.DataFrame(data, index=['H001','H002','H003','H004'])

housing

      Sqft  Price
H001   500  25000
H002   750  37500
H003   300  15000
H004   450  22500

In [24]:
housing.loc['H001']

Sqft       500
Price    25000
Name: H001, dtype: int64

In [25]:
housing.loc['H001':'H003']

      Sqft  Price
H001   500  25000
H002   750  37500
H003   300  15000

In [26]:
housing.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, H001 to H004
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sqft    4 non-null      int64
 1   Price   4 non-null      int64
dtypes: int64(2)
memory usage: 268.0+ bytes

In [27]:
housing.shape

(4, 2)

In [28]:
housing = housing.append({'Sqft':400, 'Price': 25000}, ignore_index=True)
housing

C:\Users\Dell\AppData\Local\Temp\ipykernel_12788\1789196651.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  housing = housing.append({'Sqft':400, 'Price': 25000}, ignore_index=True)

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  25000

In [29]:
## to get dataframe infromation .describe()
housing.describe()

             Sqft         Price
count    5.000000      5.000000
mean   480.000000  25000.000000
std    168.077363   8100.925873
min    300.000000  15000.000000
25%    400.000000  22500.000000
50%    450.000000  25000.000000
75%    500.000000  25000.000000
max    750.000000  37500.000000

In [30]:
## to get visual reference of data set, to get for 1st 5 rows  .head()
housing.head()

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  25000

In [31]:
housing.head(3)

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000

In [32]:
housing.tail()

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  25000

In [33]:
housing.tail(2)

   Sqft  Price
3   450  22500
4   400  25000

In [34]:
## to get data frame columns information
housing.columns

Index(['Sqft', 'Price'], dtype='object')

In [38]:
## to rename the columns>> .rename(columns={'oldcol':'newcol'}, inplace=True)
housing.rename(columns={'price':'Price'}, inplace=True)
housing

   Sqft  Price
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  25000

In [41]:

housing.columns=['size','$']
housing

   size      $
0   500  25000
1   750  37500
2   300  15000
3   450  22500
4   400  25000